kebasaa/datalogger_esp8266/src/main.cpp
#include <Arduino.h>
#include "config.h"

#define H4P_VERBOSE 1 // To see what's going on
#include <H4Plugins.h>
H4_USE_PLUGINS(PROJ_BAUD_RATE, H4_Q_CAPACITY, false) // Serial baud rate, Q size, SerialCmd autostop

// This creates wrapper functions that can't be declared anywhere else than in main.cpp
#include "h4_wrapper.h"
// Permanent storage of data/variables
bool h4_gvExists(std::string name){
  return h4p.gvExists(name);
}
void h4_gvSetInt(std::string name, int value, bool save){
  h4p.gvSetInt(name, value, save);
}
void h4_gvSetString(std::string name, std::string value, bool save){
  h4p.gvSetstring(name, value, save);
}
int h4_gvGetInt(std::string name){
  return h4p.gvGetInt(name);
}

// Store whether any viewers are connected
bool viewersConnected = false;

#include <math.h>
#include <stdarg.h>
#include <string.h>

// Default I2C bus on D2=SDA, D1=SCL
#include <Wire.h>

//H4P_SerialLogger h4sl;
//H4P_PinMachine h4gm; // For buttons

#ifdef ARDUINO_ARCH_ESP8266
#define BIG_SIZE 500
#else
#define BIG_SIZE 13000
#endif

char* dev_name = "Datalogger";
#if H4P_USE_WIFI_AP
String wifitype = "WIFI: AP mode";
H4P_WiFi h4wifi; //h4wifi(dev_name);
#else
String wifitype = "WIFI: Client mode";
H4P_WiFi h4wifi(WIFI_SSID, WIFI_PASS, dev_name);
#endif


#if USE_MQTT
#if H4P_USE_WIFI_AP
H4P_AsyncMQTT h4mqtt;
#else
H4P_AsyncMQTT h4mqtt(MQTT_SERVER);
#endif // H4P_USE_WIFI_AP
uint8_t big[BIG_SIZE];
H4_TIMER mqttSender;
H4_TIMER bigSender;
#endif // USE_MQTT

//H4P_Heartbeat h4hb; // Show uptime

#if USE_HTTPREQ
H4P_AsyncHTTP h4ah;
H4_TIMER httpReqTimer;
//void HTTPClient();
#endif
//void publishDevice(const std::string &topic, const std::string &payload);
//void publishDevice(const std::string &topic, long long payload);

int n_measurements = 0;

// Run a test
#if RUN_TEST
# include <test.h>
Test test;
#endif

#if I2C_MULTI
#include <TCA9548_multiplexer.h>
MULTI mp;
int i2c_buses[] = {0,1};
#endif

// MicroSD card reader
#if USE_MICROSD
# include <MicroSD.h>
MicroSD sd;
#endif

// Battery
#if USE_BATTERY
# include <Battery.h>
Battery bat;
#endif

// GPS device
#if USE_GPS
# include <GPS.h>
#if I2C_MULTI
GPS gps(&mp, 2); // Not connected to the multiplexer, this will not affect anything
#else
GPS gps();
#endif
#endif

// T, RH, P sensor
#if USE_BME280
#include <BME280_sen.h>
#if I2C_MULTI
BME bme1(&mp, 0); // Initialise buses 0 & 1
BME bme2(&mp, 1);
BME* bme_sensors[] = { &bme1, &bme2 };
#else
BME bme(&mp, 1); // Initialise bus 1 only
BME* bme_sensors[] = { &bme };
#endif
#endif

// CO2 sensor
#if USE_SCD30
#include <SCD30.h>
#if I2C_MULTI
SCD scd1(&mp, 0); // Initialise buses 0 & 1
SCD scd2(&mp, 1);
SCD* scd_sensors[] = { &scd1, &scd2 };
#else
SCD scd(&mp, 1); // Initialise bus 2 only
SCD* scd_sensors[] = { &scd };
#endif
#endif

// LWR sensor
#if USE_MLX90614
#include <MLX90614.h>
#if I2C_MULTI
MLX mlx1(&mp, 0); // Initialise buses 0 & 1
MLX mlx2(&mp, 1);
MLX* mlx_sensors[] = { &mlx1, &mlx2 };
#else
MLX mlx(&mp, 1); // Initialise bus 1 only
MLX* mlx_sensors[] = { &mlx };
#endif
#endif

// ADS1115 analog-to-digital converter, not used in this project
#if USE_ADS1115
# include <ADS1115.h>
#if I2C_MULTI
ADS ads1(&mp, 0); // Initialise buses 0 & 1
ADS ads2(&mp, 1);
ADS* ads_sensors[] = { &ads1, &ads2 };
#else
ADS ads(&mp, 1); // Initialise bus 1 only
ADS* ads_sensors[] = { &ads };
#endif
#endif

// SEN0465 O2 sensor
#if USE_SEN0465
#include <SEN0465.h>
#if I2C_MULTI
SEN0465 sen1(&mp, 0); // Initialise buses 0 & 1
SEN0465 sen2(&mp, 1);
SEN0465* sen_sensors[] = { &sen1, &sen2 };
#else
SEN0465 sen(&mp, 1); // Initialise bus 1 only
SEN0465* sen_sensors[] = { &sen };
#endif
#endif

// Calculate environmental parameters
#if USE_ENV
#include <Environmental.h>
Env env;
#endif

#include <Utils.h>
Utils utils;

#if USE_CAL
#include <Calibration.h>
Cal cal;
std::vector<String> gases;// = {"co2", "o2", "h2o"};
// numSensors depends on whether "Multi" is active
#if I2C_MULTI
  int numSensors = 2;
  #else
  int numSensors = 1;
#endif
int currentSensor = -9999;
String currentGas = "all";
String currentDiffGas = "all";
bool calibration_running = false;
#endif

H4_TIMER  TIM0;

// Timezone setup
//H4P_Timekeeper h4tk(NTP1, NTP2, LocalTZO);  // Time support
//boolean ClockValid = false;  // Flag indicating whether to display the clock or not.

// Wifi
boolean WiFiValid = false;  // Flag indicating a valid WiFi Connection is active.

const size_t DATA_ROW_BUFFER_SIZE = 3072;
const uint16_t ROW_STATUS_TRUNCATED = 0x8000;
const uint32_t I2C_SLOW_THRESHOLD_MS = 1000;
const uint32_t I2C_RECOVERY_CONSECUTIVE_ERRORS = 3;
const uint32_t I2C_RECOVERY_COOLDOWN_MS = 300000UL;
const uint32_t GPS_FRESH_MAX_AGE_MS = 120000UL;
const uint32_t GPS_STALE_CONSECUTIVE_SAMPLES = 3;
const uint32_t GPS_RECOVERY_COOLDOWN_MS = 300000UL;

char data_header[DATA_ROW_BUFFER_SIZE] = "";
char data_row_buf[DATA_ROW_BUFFER_SIZE] = "";
char status_row_buf[512] = "";
char reset_reason_buf[48] = "unknown";
uint32_t boot_ms = 0;
uint32_t boot_id = 0;
uint32_t sample_counter = 0;
uint16_t last_data_write_status = 0;
bool data_header_ready = false;
bool gps_boot_locked = false;
bool boot_status_written = false;
bool sd_status_pending = false;
char last_valid_gps_date[9] = "";
uint32_t gps_stale_count = 0;
uint32_t gps_recovery_count = 0;
uint32_t last_gps_recovery_ms = 0;
bool gps_stale_active = false;
bool gps_stale_status_pending = false;
bool gps_recovered_status_pending = false;

#if I2C_MULTI
uint32_t i2c_slow_count[2] = {0, 0};
uint32_t i2c_error_count[2] = {0, 0};
uint32_t i2c_consecutive_error_count[2] = {0, 0};
uint32_t i2c_recovery_count[2] = {0, 0};
uint32_t i2c_last_recovery_ms[2] = {0, 0};
#else
uint32_t i2c_slow_count[1] = {0};
uint32_t i2c_error_count[1] = {0};
uint32_t i2c_consecutive_error_count[1] = {0};
uint32_t i2c_recovery_count[1] = {0};
uint32_t i2c_last_recovery_ms[1] = {0};
#endif
bool i2c_recovery_status_pending = false;

struct CsvBuffer {
  char* buf;
  size_t size;
  size_t len;
  bool truncated;
};

void csv_init(CsvBuffer& csv, char* buf, size_t size) {
  csv.buf = buf;
  csv.size = size;
  csv.len = 0;
  csv.truncated = false;
  if (size > 0) csv.buf[0] = '\0';
}

