kebasaa/datalogger_esp8266/src/main.cpp
void csv_append_raw(CsvBuffer& csv, const char* text) {
  if (csv.len >= csv.size) {
    csv.truncated = true;
    return;
  }
  int written = snprintf(csv.buf + csv.len, csv.size - csv.len, "%s", text ? text : "");
  if (written < 0 || (size_t)written >= csv.size - csv.len) {
    csv.len = csv.size - 1;
    csv.buf[csv.len] = '\0';
    csv.truncated = true;
  } else {
    csv.len += (size_t)written;
  }
}

void csv_appendf(CsvBuffer& csv, const char* fmt, ...) {
  if (csv.len >= csv.size) {
    csv.truncated = true;
    return;
  }
  va_list args;
  va_start(args, fmt);
  int written = vsnprintf(csv.buf + csv.len, csv.size - csv.len, fmt, args);
  va_end(args);
  if (written < 0 || (size_t)written >= csv.size - csv.len) {
    csv.len = csv.size - 1;
    csv.buf[csv.len] = '\0';
    csv.truncated = true;
  } else {
    csv.len += (size_t)written;
  }
}

void csv_field(CsvBuffer& csv, const char* text) {
  csv_append_raw(csv, text);
  csv_append_raw(csv, ",");
}

void csv_uint(CsvBuffer& csv, uint32_t value) {
  csv_appendf(csv, "%lu,", (unsigned long)value);
}

void csv_int(CsvBuffer& csv, int value) {
  csv_appendf(csv, "%d,", value);
}

void csv_float(CsvBuffer& csv, float value, uint8_t decimals = 2) {
  if (isnan(value) || isinf(value)) {
    csv_append_raw(csv, ",");
  } else {
    char tmp[24];
    dtostrf(value, 0, decimals, tmp);
    csv_append_raw(csv, tmp);
    csv_append_raw(csv, ",");
  }
}

void sanitize_csv_text(const String& src, char* dst, size_t dst_size) {
  if (dst_size == 0) return;
  size_t j = 0;
  for (size_t i = 0; i < src.length() && j < dst_size - 1; i++) {
    char c = src.charAt(i);
    dst[j++] = (c == ',' || c == '\r' || c == '\n') ? ' ' : c;
  }
  dst[j] = '\0';
}

uint32_t heap_free_now() {
#if defined(ARDUINO_ARCH_ESP32)
  return _HAL_freeHeap(MALLOC_CAP_INTERNAL);
#else
  return _HAL_freeHeap();
#endif
}

uint32_t heap_max_block_now() {
#if defined(ARDUINO_ARCH_ESP32)
  return _HAL_maxHeapBlock(MALLOC_CAP_INTERNAL);
#else
  return _HAL_maxHeapBlock();
#endif
}

uint32_t heap_min_block_now() {
#if defined(ARDUINO_ARCH_ESP32)
  return _HAL_minHeapBlock(MALLOC_CAP_INTERNAL);
#else
  return _HAL_minHeapBlock();
#endif
}

uint32_t i2c_slow_total() {
  uint32_t total = 0;
  for (size_t i = 0; i < sizeof(i2c_slow_count) / sizeof(i2c_slow_count[0]); i++) total += i2c_slow_count[i];
  return total;
}

uint32_t i2c_error_total() {
  uint32_t total = 0;
  for (size_t i = 0; i < sizeof(i2c_error_count) / sizeof(i2c_error_count[0]); i++) total += i2c_error_count[i];
  return total;
}

uint32_t i2c_recovery_total() {
  uint32_t total = 0;
  for (size_t i = 0; i < sizeof(i2c_recovery_count) / sizeof(i2c_recovery_count[0]); i++) total += i2c_recovery_count[i];
  return total;
}

void build_data_header() {
  CsvBuffer header;
  csv_init(header, data_header, sizeof(data_header));
  csv_append_raw(header, "boot_id,sample_counter,uptime_ms,timestamp_boot_ms,reset_reason,");
#if USE_GPS
  csv_append_raw(header, "gps_date_valid,gps_time_fresh,gps_location_valid,gps_location_fresh,gps_chars_processed,gps_age_ms,gps_location_age_ms,gps_stale_count,gps_recovery_count,timestamp_utc,lat,lon,alt,nb_sat,HDOP,");
#endif
#if USE_BATTERY
  csv_append_raw(header, "bat.mV,bat.perc,");
#endif

#if I2C_MULTI
  size_t n = sizeof(i2c_buses)/sizeof(i2c_buses[0]);
  for (size_t i = 0; i < n; ++i) {
#endif
#if USE_ADS1115
    csv_append_raw(header, "Sin.W_m2,Sout.W_m2,");
#endif
#if USE_BME280
    csv_append_raw(header, "bme_T.C,bme_RH.perc,bme_P.Pa,bme_H2O.mmol_mol,");
  #if USE_CAL
    csv_append_raw(header, "bme_T.C.cal,bme_T.flag,bme_P.Pa.cal,bme_P.flag,bme_H2O.mmol_mol.cal,bme_H2O.mmol_mol.flag,bme_RH.perc.cal,bme_RH.flag,");
  #else
    csv_append_raw(header, "bme_T.C,bme_RH.perc,bme_P.Pa,bme_H2O.mmol_mol,");
  #endif
#endif
#if USE_SCD30
    csv_append_raw(header, "scd_T.C,scd_RH.perc,scd_CO2.ppm,");
  #if USE_CAL
    csv_append_raw(header, "scd_CO2.ppm.cal,scd_CO2.flag,");
  #else
    csv_append_raw(header, "scd_CO2.ppm,");
  #endif
#endif
#if USE_SEN0465
    csv_append_raw(header, "sen_T.C,sen_O2.mmol_mol,");
  #if USE_CAL
    csv_append_raw(header, "sen_O2.mmol_mol.cal,sen_O2.flag,");
  #else
    csv_append_raw(header, "sen_O2.mmol_mol,");
  #endif
#endif
#if USE_MLX90614
    csv_append_raw(header, "mlx_T.C,mlx_obj_T.C,");
#endif
#if I2C_MULTI
  }
#endif
  csv_append_raw(header, "free_heap,max_heap_block,min_heap_block,i2c_slow_count,i2c_error_count,i2c_recovery_count,");
  for (size_t i = 0; i < sizeof(i2c_error_count) / sizeof(i2c_error_count[0]); i++) {
    csv_appendf(header, "i2c_bus%u_error_count,i2c_bus%u_consecutive_error_count,i2c_bus%u_recovery_count,", (unsigned)i, (unsigned)i, (unsigned)i);
  }
  csv_append_raw(header, "write_status,");
  data_header_ready = !header.truncated;
}

void recoverI2C(size_t bus_index) {
#if I2C_MULTI
  mp.disableAllBuses();
#endif
#if defined(ARDUINO_ARCH_ESP32) || defined(ARDUINO_ARCH_RP2040)
  Wire.end();
#endif
  Wire.begin();
#if USE_BME280
  bme_sensors[bus_index]->init();
#endif
#if USE_SCD30
  if (scd_sensors[bus_index]->init()) {
    scd_sensors[bus_index]->enable_self_calibration(false);
    scd_sensors[bus_index]->set_interval(2);
  }
#endif
#if USE_SEN0465
  sen_sensors[bus_index]->init();
#endif
  i2c_recovery_count[bus_index]++;
  i2c_last_recovery_ms[bus_index] = millis();
  i2c_recovery_status_pending = true;
}

void record_i2c_health(size_t bus_index, uint32_t elapsed_ms, bool error_seen) {
  if (elapsed_ms > I2C_SLOW_THRESHOLD_MS) i2c_slow_count[bus_index]++;
  if (error_seen || elapsed_ms > I2C_SLOW_THRESHOLD_MS) {
    if (i2c_consecutive_error_count[bus_index] == 0) i2c_error_count[bus_index]++;
    i2c_consecutive_error_count[bus_index]++;
  } else {
    i2c_consecutive_error_count[bus_index] = 0;
    return;
  }
  uint32_t now_ms = millis();
  if (i2c_consecutive_error_count[bus_index] >= I2C_RECOVERY_CONSECUTIVE_ERRORS &&
      (i2c_last_recovery_ms[bus_index] == 0 || now_ms - i2c_last_recovery_ms[bus_index] >= I2C_RECOVERY_COOLDOWN_MS)) {
    recoverI2C(bus_index);
  }
}

bool isGPSDateValid();
bool isGPSTimeFresh();
bool isGPSLocationFresh();
void recoverGPS();

