kebasaa/datalogger_esp8266/src/main.cpp
uint16_t write_status_row(const char* event, uint16_t related_write_status) {
#if USE_MICROSD
  if (!gps_boot_locked || last_valid_gps_date[0] == '\0') return MicroSD::WRITE_CARD_MISSING;
  char status_fn[32];
  snprintf(status_fn, sizeof(status_fn), "status_%s.csv", last_valid_gps_date);
  const char* status_header =
    "event,boot_id,sample_counter,uptime_ms,reset_reason,free_heap,max_heap_block,min_heap_block,"
    "gps_date_valid,gps_time_fresh,gps_location_valid,gps_location_fresh,gps_stale_count,gps_recovery_count,"
    "i2c_error_count,i2c_recovery_count,related_write_status,card_missing_count,header_open_fail_count,"
    "append_open_fail_count,print_fail_count,flush_fail_count,close_fail_count,";
  CsvBuffer row;
  csv_init(row, status_row_buf, sizeof(status_row_buf));
  csv_field(row, event);
  csv_uint(row, boot_id);
  csv_uint(row, sample_counter);
  csv_uint(row, millis() - boot_ms);
  csv_field(row, reset_reason_buf);
  csv_uint(row, heap_free_now());
  csv_uint(row, heap_max_block_now());
  csv_uint(row, heap_min_block_now());
#if USE_GPS
  csv_int(row, isGPSDateValid() ? 1 : 0);
  csv_int(row, isGPSTimeFresh() ? 1 : 0);
  csv_int(row, gps.locationValid() ? 1 : 0);
  csv_int(row, isGPSLocationFresh() ? 1 : 0);
  csv_uint(row, gps_stale_count);
  csv_uint(row, gps_recovery_count);
#else
  csv_int(row, 0);
  csv_int(row, 0);
  csv_int(row, 0);
  csv_int(row, 0);
  csv_uint(row, 0);
  csv_uint(row, 0);
#endif
  csv_uint(row, i2c_error_total());
  csv_uint(row, i2c_recovery_total());
  csv_uint(row, related_write_status);
  csv_uint(row, sd.cardMissingCount());
  csv_uint(row, sd.headerOpenFailCount());
  csv_uint(row, sd.appendOpenFailCount());
  csv_uint(row, sd.printFailCount());
  csv_uint(row, sd.flushFailCount());
  csv_uint(row, sd.closeFailCount());
  return sd.write_data(status_fn, status_header, status_row_buf, 86400);
#else
  return 0;
#endif
}

bool isGPSDateValid() {
    #if USE_GPS
        if (!gps.dateValid()) return false;
        String date = gps.get_date();
        int year = date.substring(0, 4).toInt();
        return (year >= 2025) && (year <= 2050);
    #else
        return false; // Or true, depending on if you want to proceed without GPS
    #endif
}

bool isGPSTimeFresh() {
    #if USE_GPS
        return isGPSDateValid() && gps.timeValid() && gps.gpsAgeMs() <= GPS_FRESH_MAX_AGE_MS;
    #else
        return false;
    #endif
}

bool isGPSLocationFresh() {
    #if USE_GPS
        return gps.locationValid() && gps.locationAgeMs() <= GPS_FRESH_MAX_AGE_MS;
    #else
        return false;
    #endif
}

void recoverGPS() {
    #if USE_GPS
    #if I2C_MULTI
        mp.disableAllBuses();
    #endif
    #if defined(ARDUINO_ARCH_ESP32) || defined(ARDUINO_ARCH_RP2040)
        Wire.end();
    #endif
        Wire.begin();
        gps.init();
        gps_recovery_count++;
        last_gps_recovery_ms = millis();
    #endif
}

void onWiFiConnect() {
	Serial.printf("Wifi connected");
	Serial.printf("IP4 Address: %s\n",WiFi.localIP().toString().c_str());
	WiFiValid = true;
#if USE_HTTPREQ
	h4.queueFunction(HTTPClient);
	httpReqTimer = h4.every(60000, HTTPClient);
#endif
}
void onWiFiDisconnect() {
	Serial.printf("WiFi Disconnected\n");
#if USE_HTTPREQ
	h4.cancel(httpReqTimer);
#endif
}
#if USE_MQTT
void onMQTTConnect() {
	mqttSender = h4.every(2000, []()
					  {
						  publishDevice("heap", _HAL_freeHeap());
						  publishDevice("uptime",h4p.gvGetstring(upTimeTag()));
						  publishDevice("maxbloc",_HAL_maxHeapBlock());
					  });
	
	bigSender = h4.every(3000,[]{
		Serial.printf("SENDING BIG\n");
		h4mqtt.publish("big", &big[0], BIG_SIZE, 1);
	});
}
void onMQTTDisconnect() {
	Serial.printf("onMQTTDisconnect()\n");
	h4.cancel(mqttSender);
	h4.cancel(bigSender);
}
#endif

void absolute_calibration(const std::vector<String> gas_list, String abs_cal_type, int sensor, float ref_value);
void differential_calibration(const std::vector<String> gas_list, String dif_cal_type);

// Show calibration coefficients through the Serial Port. The syntax is:
// show_cal
uint32_t cal_show_cmd(std::vector<std::string> vs) {
  Serial.println("Calibration coefficients:");
  cal.show_all_calibrations(gases, numSensors);
  return H4_CMD_OK;
}

// Manually set calibration coefficients through the Serial Port. The syntax is:
// set/zero/co2/1/12.07/13.08
// set/span/co2/2/376.87/402.87
// Where the first number is the reference, and the second the measured value by the sensor for that reference
uint32_t cal_set_cmd(std::vector<std::string> vs) {
  Serial.println("Manually entering sensor calibration coefficients");
  Serial.printf("Params received: %d\n", vs.size());
  if (vs.size() < 5) {
    Serial.println("Min. 5 parameters: type (zero/span), gas, sensor number, ref. value and measured value");
    return H4_CMD_TOO_FEW_PARAMS;
  } else if(vs.size() > 5){
    Serial.println("Max. 5 parameters: type (zero/span), gas, sensor number, ref. value and measured value");
    return H4_CMD_TOO_MANY_PARAMS;
  }
  // Collect the values
  String abs_cal_type = vs[0].c_str();
  String cal_gas = vs[1].c_str();
  int sensor_nb = std::stoi(vs[2].c_str());
  float ref_value = std::stof(vs[3]);
  float sen_value = std::stof(vs[4]);
  // Forceds acceptance of serial port values no matter the timing
  int ts = 0;
  if(abs_cal_type == "span"){ ts = 20; }
  // Set calibration values
  cal.set_calibration_coeff(abs_cal_type, cal_gas, sensor_nb, ref_value, sen_value, ts);
  return H4_CMD_OK;
}

// Calibration through the Serial Port. The syntax is:
// cal/span/h2o/0/1.31
// cal/zero/co2/1
// cal/zero/co2/1/0.54
// cal/span/h2o/2/409.87
// cal/diff/co2/low
// cal/diff/co2/high
uint32_t cal_cmd(std::vector<std::string> vs) {
    Serial.println("Sensor calibration initiated");
    Serial.printf("Params received: %d\n", vs.size());
    if (vs.size() < 2) {
        Serial.println("Calibration command requires at least 2 parameters: type and gas");
        return H4_CMD_TOO_FEW_PARAMS;
    }
    std::string cal_type = vs[0];
    std::string cal_gas = vs[1];
    // Validate calibration type
    if (!utils.in_list(cal.calTypes, String(cal_type.c_str()))) {
        Serial.printf("Invalid calibration type: %s (must be %s)\n", cal_type.c_str(), utils.make_text_list(cal.calTypes));
        return H4_CMD_PAYLOAD_FORMAT;
    }
    // Validate gas
    if (!utils.in_list(gases, String(cal_gas.c_str()))) {
        Serial.printf("Invalid calibration gas: %s (must be %s)\n", cal_gas.c_str(), utils.make_text_list(gases));
        return H4_CMD_PAYLOAD_FORMAT;
    }
    //Serial.printf("Type: %s, Gas: %s\n", cal_type.c_str(), cal_gas.c_str());
    // After validation, update the global variables
    int cal_sensor = 0;
    float cal_ref_value = 0.0;
    if (cal_type == "zero") {
        // Requires sensor (3 params), cal_fef_value optional (default 0.0)
        if (vs.size() == 2) {
            Serial.println("Zero calibration requires a sensor number");
            return H4_CMD_TOO_FEW_PARAMS;
        } else if (vs.size() == 3) {
            cal_sensor = std::stoi(vs[2].c_str());
            cal_ref_value = 0.0; // Default
            Serial.printf("Zero cal: Gas: %s, Sensor=%d, Reference=%.2f\n", cal_gas.c_str(), cal_sensor, cal_ref_value);
            // Perform calibration
            absolute_calibration({cal_gas.c_str()}, "zero", cal_sensor, cal_ref_value);
        } else if (vs.size() == 4) {
            cal_sensor = std::stoi(vs[2].c_str());
            cal_ref_value = std::stoi(vs[3]);
            Serial.printf("Zero cal: Gas: %s, Sensor=%d, Reference=%.2f\n", cal_gas.c_str(), cal_sensor, cal_ref_value);
            // Perform calibration
            absolute_calibration({cal_gas.c_str()}, "zero", cal_sensor, cal_ref_value);
        } else {
            Serial.println("Too many params for zero calibration");
            return H4_CMD_TOO_MANY_PARAMS;
        }
    } else if (cal_type == "span") {
        // Requires sensor and cal_ref_value (4 params)
        if (vs.size() < 4) {
            Serial.println("Span calibration requires sensor and reference value");
            return H4_CMD_TOO_FEW_PARAMS;
        } else if (vs.size() == 4) {
            cal_sensor = std::stoi(vs[2].c_str());
            cal_ref_value = std::stof(vs[3]);
            Serial.printf("Span cal: Gas: %s, Sensor=%d, Reference=%.2f\n", cal_gas.c_str(), cal_sensor, cal_ref_value);
            // Perform calibration
            currentGas = cal_gas.c_str(); // There is a clause that checks if currentGas is all in absolute_calibration(). This avoids that
            absolute_calibration({cal_gas.c_str()}, "span", cal_sensor, cal_ref_value);
        } else {
            Serial.println("Too many params for span calibration");
            return H4_CMD_TOO_MANY_PARAMS;
        }
    } else if (cal_type == "diff") {
        // Requires type, gas and low/high (3 params), no sensor/cal_ref_value
        if(vs.size() > 3) {
            Serial.println("Diff calibration requires at least 2 parameters: gas and type (low/high)");
            return H4_CMD_TOO_FEW_PARAMS;
        } else if (vs.size() == 3) {
            // "sen" is for the high calibration, "ref" for low
            String low_high = "";
            if(vs[2] == "low"){
              low_high = "ref";
            } else if (vs[2] == "high"){
              low_high = "sen";
            } else {
              // Bad command, don't calibrate
              return H4_CMD_PAYLOAD_FORMAT;
            }
            Serial.printf("Diff cal: Gas: %s, Type=%s\n", cal_gas.c_str(), low_high);
            differential_calibration({cal_gas.c_str()}, low_high);
        } else if(vs.size() > 3) {
            Serial.println("Diff calibration does not accept sensor/reference value");
            return H4_CMD_TOO_MANY_PARAMS;
        }
    }
    return H4_CMD_OK;
}

// Measure for 5s and average, when button is pressed
float measure_gas(String gas, int sensor){
  float gas_measured = float(NAN);
  if((gas == "all") || (gas == "") || (sensor == -9999)){
    return(float(NAN));
  }
  // Note that the sensor list is 0-indexed, i.e. the number needs to be -1
  //sensor -= 1;

