kebasaa/datalogger_esp8266/src/main.cpp
  if(gas == "co2"){
  #if USE_SCD30
    gas_measured = scd_sensors[sensor]->airCO2();
  #endif
  }
  if (gas == "o2"){
  #if USE_SEN0465
    gas_measured = sen_sensors[sensor]->airO2();
  #endif
  }
  if (gas == "h2o"){
  #if USE_BME280
    // This sensor measures RH, but that's not useful for calibration, so the mole fraction has to be calculated
    gas_measured = env.air_water_mole_frac(bme_sensors[sensor]->airT(),
                                           bme_sensors[sensor]->airRH(),
                                           bme_sensors[sensor]->airP());
  #endif
  }
  if (gas == "temperature"){
  #if USE_BME280
    gas_measured = bme_sensors[sensor]->airT();
  #endif
  }
  if (gas == "pressure"){
  #if USE_BME280
    gas_measured = bme_sensors[sensor]->airP();
  #endif
  }
  
  return(gas_measured);
}

void onViewersConnect() {
  viewersConnected = true;
	Serial.printf("onViewersConnect\n");
  h4wifi.uiAddText("Timestamp (UTC)", "");
  h4wifi.uiAddText("Location", "");
  h4wifi.uiAddText("Battery", "");
  h4wifi.uiAddText("---","");

  h4wifi.uiAddText("Zero & Span","Calibration");
  h4wifi.uiAddDropdown("Gas Sensor",{
    {"All","all"},
    {"H₂O","h2o"},
    {"CO₂","co2"},
    {"O₂", "o2"},
    {"Temperature", "temperature"},
  });
  h4wifi.uiAddDropdown("Sensor Number",{
    {"-9999","-9999"},
    {"0","0"},
    {"1","1"}
  });
  h4wifi.uiAddInput("Zero gas");
  h4wifi.uiAddImgButton("setzero");
  h4wifi.uiAddInput("Span gas");
  h4wifi.uiAddImgButton("setspan");
  Serial.print("Current Gas: "); Serial.println(currentGas);
  h4wifi.uiAddText("Gas",currentGas.c_str());
  h4wifi.uiAddText("Sensor",currentSensor);
  h4wifi.uiAddText("Zero value",CSTR(String(cal.read_calibration_var("sen", "zero", currentGas, currentSensor))));
  h4wifi.uiAddText("Zero reference",CSTR(String(cal.read_calibration_var("ref", "zero", currentGas, currentSensor))));
  h4wifi.uiAddText("Span value",CSTR(String(cal.read_calibration_var("sen", "span", currentGas, currentSensor))));
  h4wifi.uiAddText("Span reference",CSTR(String(cal.read_calibration_var("ref", "span", currentGas, currentSensor))));
  h4wifi.uiAddText("Raw value", "");
  h4wifi.uiAddText("Calibrated value", "");

  h4wifi.uiAddText("----","");
  h4wifi.uiAddText("Alternative:","Δ Calibration");
  h4wifi.uiAddDropdown("Δ Type",{
    {"All","all"},
    {"H₂O","h2o"},
    {"CO₂","co2"},
    {"O₂", "o2"},
    {"Temperature", "temperature"},
    {"Pressure", "pressure"},
  });
  h4wifi.uiAddImgButton("setdiffLow");
  h4wifi.uiAddImgButton("setdiffHigh");
  h4wifi.uiAddText("Δ Gas",currentDiffGas.c_str());
  h4wifi.uiAddText("Sen. 0 value","");
  h4wifi.uiAddText("Sen. 1 value","");
  h4wifi.uiAddText("Sen. 1 (Cal.)","");
  
  h4wifi.uiAddText("---","");
  h4wifi.uiAddImgButton("reset");
  
  // Every second, update the UI (only while someone is connected to the webUI)
  TIM0=h4.every(1000,[](){
    #if USE_GPS
    if (!isGPSDateValid()) {
      h4wifi.uiSetValue("Timestamp (UTC)","NO GPS SIGNAL");
      h4wifi.uiSetValue("Location","NO GPS SIGNAL");
    } else {
      h4wifi.uiSetValue("Timestamp (UTC)",CSTR(gps.get_timestamp()));
      h4wifi.uiSetValue("Location",CSTR(gps.get_short_location()));
    }
    #else
    h4wifi.uiSetValue("Timestamp (UTC)","No GPS module");
    #endif
    float measured_value = measure_gas(currentGas, currentSensor);
    Cal::CalibrationResult cal_result = cal.calibrate_linear(currentGas, currentSensor, measured_value);
    //float calibrated_value = cal.calibrate_linear(currentGas, currentSensor, measured_value);
    h4wifi.uiSetValue("Battery",CSTR(String(bat.battery_pc())));
    if(!calibration_running){
      h4wifi.uiSetValue("Raw value",CSTR(String(measured_value)));
      h4wifi.uiSetValue("Calibrated value",CSTR(String(cal_result.calibratedValue)));
      h4wifi.uiSetValue("Sen. 0 value",CSTR(String(measure_gas(currentDiffGas, 0))));
      h4wifi.uiSetValue("Sen. 1 value",CSTR(String(measure_gas(currentDiffGas, 1))));
    }
    measured_value = measure_gas(currentDiffGas, 1);
    //calibrated_value = cal.calibrate_linear(currentDiffGas, 1, measured_value);
    cal_result = cal.calibrate_linear(currentDiffGas, 1, measured_value);
    h4wifi.uiSetValue("Sen. 1 (Cal.)",CSTR(String(cal_result.calibratedValue)));
  });       
}

void onViewersDisconnect() {
	Serial.printf("onViewersDisconnect\n");
  h4.cancel({TIM0}); // Stop updating the UI
  viewersConnected = false;
}

// TODO: Can I use this?
void h4_set_ui_text(std::string  field, std::string  value){
  h4wifi.uiSetValue(field, value);
}

void save_calibration_coefficients(void){
  // Save calibration data to file
  String cal_data_str = "";
  String cal_header = "";
  #if USE_GPS
    if (!isGPSDateValid()) {
      h4wifi.uiMessage("Error: No GPS fix");
      Serial.print(F("Invalid GPS date"));
      return;
    }
    String calibration_fn = "calibration_" + gps.get_date() + ".csv";
    cal_header   = "timestamp_utc,";
    cal_data_str = gps.get_timestamp() + ",";
  #else
    String data_fn = "calibration.csv";
  #endif
  cal_header   += cal.get_all_cal_header(gases, numSensors);
  cal_data_str += cal.get_all_cal_data(gases, numSensors);
  #if USE_MICROSD
    // Write data to disk
    sd.write_data(calibration_fn.c_str(),
                  cal_header.c_str(),
                  cal_data_str.c_str(),
                  86400); // logging max 1x/day, used to calculate space on the SD
                          // (should always be enough as there is only little data from calibrations)
  #endif
  return;
}

void absolute_calibration(const std::vector<String> gas_list, String abs_cal_type, int sensor, float ref_value = 0.0){
  // Don't do a span calibration for all gases at once
  if((abs_cal_type == "span") && (currentGas == "all")){ return; }
  // Don't run another calibration if it's already running
  if (calibration_running) {
    Serial.println("Calibration already running - ignoring request");
    return;
  }
  calibration_running = true;

  // Debug, show reference value
  Serial.print("Ref.: "); Serial.println(ref_value);

