kebasaa/datalogger_esp8266/src/main.cpp
  // shared accumulators (captured into lambdas by value)
  auto cumulative_s1 = std::make_shared<std::vector<float>>(gas_list.size(), 0.0f);
  auto cumulative_s2 = std::make_shared<std::vector<float>>(gas_list.size(), 0.0f);
  const int n_measurements = 10;

    h4.nTimesRandom(
        // Measure "n_measurements" times (every ~1.0-1.1s) & average
        n_measurements, 1000, 1100,
        // Run at every iteration: measure every gas and accumulate
        [gas_list, cumulative_s1, cumulative_s2]() {
            for (size_t i = 0; i < gas_list.size(); ++i) {
                (*cumulative_s1)[i] += measure_gas(gas_list[i], 0);
                (*cumulative_s2)[i] += measure_gas(gas_list[i], 1);
            }
            h4wifi.uiSetValue("Sen. 0 value", "In progress");
            h4wifi.uiSetValue("Sen. 1 value", "In progress");
        },
        // Run when timer finishes: compute averages & store/set differential for each gas
        [gas_list, cumulative_s1, cumulative_s2, n_measurements, dif_cal_type]() {
            const unsigned long ts = gps.seconds_since_midnight(); // single timestamp
            for (size_t i = 0; i < gas_list.size(); ++i) {
                float avg0 = (*cumulative_s1)[i] / n_measurements;
                float avg1 = (*cumulative_s2)[i] / n_measurements;
                // set differential for each gas
                cal.set_differential_coeff(dif_cal_type, gas_list[i], avg0, avg1, ts);

                Serial.print("Gas: "); Serial.println(gas_list[i]);
                Serial.print("Sen. 0 avg: "); Serial.println(avg0);
                Serial.print("Sen. 1 avg: "); Serial.println(avg1);
            }

            // reset accumulators (optional since shared_ptr is freed after lambda ends)
            for (size_t i = 0; i < gas_list.size(); ++i) { (*cumulative_s1)[i] = 0.0f; (*cumulative_s2)[i] = 0.0f; }

            if(viewersConnected == true){
              h4wifi.uiSetValue("Sen. 0 value", "");
              h4wifi.uiSetValue("Sen. 1 value", "");
            }

            if(dif_cal_type == "sen"){
              save_calibration_coefficients();
            }
            calibration_running = false;
        },
        0, false
    );
}

void onsetdiffLowButton(){
  h4wifi.uiMessage("Differential calibration (low value) running...");
  Serial.println("Differential calibration (low)");

  if(currentDiffGas == "all"){
    differential_calibration(gases, "ref"); // "sen" is for the high calibration, "ref" for low
  } else {
    differential_calibration({currentDiffGas}, "ref");  // "sen" is for the high calibration, "ref" for low
  }
}

void onsetdiffHighButton(){
  h4wifi.uiMessage("Differential calibration (high value) running...");
  Serial.println("Differential calibration (high)");

  if(currentDiffGas == "all"){
    differential_calibration(gases, "sen"); // "sen" is for the high calibration, "ref" for low
  } else {
    differential_calibration({currentDiffGas}, "sen");  // "sen" is for the high calibration, "ref" for low
  }
}

void onresetButton(){
  h4wifi.uiMessage("RESET");
  Serial.println("RESET");
  cal.reset_all_calibrations(gases, numSensors);
}

H4P_EventListener allexceptmsg(H4PE_VIEWERS | H4PE_GVCHANGE,[](const std::string& svc,H4PE_TYPE t,const std::string& msg){
  switch(t){
    case H4PE_VIEWERS:
      H4P_SERVICE_ADAPTER(Viewers);
      break;
    case H4PE_GVCHANGE:
      // Connect buttons to relevant functions
      H4P_TACT_BUTTON_CONNECTOR(setspan);
      H4P_TACT_BUTTON_CONNECTOR(setzero);
      H4P_TACT_BUTTON_CONNECTOR(setdiffLow);
      H4P_TACT_BUTTON_CONNECTOR(setdiffHigh);
      H4P_TACT_BUTTON_CONNECTOR(reset);
      // Process button presses
      if(svc=="Gas Sensor"){ // Test Gas Sensor selection
        h4wifi.uiMessage("You chose %s\n",CSTR(msg));
        h4wifi.uiSetValue("Gas",CSTR(msg));
        Serial.print("You chose "); Serial.println(msg.c_str());
        // Store which gas was chosen
        currentGas = msg.c_str();
        Serial.print("currentGas, currentSensor (GAS): "); Serial.print(currentGas); Serial.print(" "); Serial.println(currentSensor);
        h4wifi.uiSetValue("Zero value",CSTR(String(cal.read_calibration_var("sen", "zero", currentGas, currentSensor))));
        h4wifi.uiSetValue("Zero reference",CSTR(String(cal.read_calibration_var("ref", "zero", currentGas, currentSensor))));
        h4wifi.uiSetValue("Span value",CSTR(String(cal.read_calibration_var("sen", "span", currentGas, currentSensor))));
        h4wifi.uiSetValue("Span reference",CSTR(String(cal.read_calibration_var("ref", "span", currentGas, currentSensor))));
        h4p.gvSetstring("Zero gas",CSTR(String(cal.read_calibration_var("ref", "zero", currentGas, currentSensor)))); // Change input field value when dropdown selection changes
        h4p.gvSetstring("Span gas",CSTR(String(cal.read_calibration_var("ref", "span", currentGas, currentSensor)))); // Change input field value when dropdown selection changes
        break;
      }
      if(svc=="Sensor Number"){ // Test sensor number selection
        h4wifi.uiMessage("You chose %s\n",CSTR(msg));
        h4wifi.uiSetValue("Sensor",CSTR(msg));
        Serial.print("You chose "); Serial.println(msg.c_str());
        // Store which sensor was chosen & convert to int
        String msg_str = msg.c_str();
        currentSensor = msg_str.toInt();
        Serial.print("currentGas, currentSensor (#): "); Serial.print(currentGas); Serial.print(" "); Serial.println(currentSensor);
        h4wifi.uiSetValue("Zero value",CSTR(String(cal.read_calibration_var("sen", "zero", currentGas, currentSensor))));
        h4wifi.uiSetValue("Zero reference",CSTR(String(cal.read_calibration_var("ref", "zero", currentGas, currentSensor))));
        h4wifi.uiSetValue("Span value",CSTR(String(cal.read_calibration_var("sen", "span", currentGas, currentSensor))));
        h4wifi.uiSetValue("Span reference",CSTR(String(cal.read_calibration_var("ref", "span", currentGas, currentSensor))));
        // Change input field default value when dropdown selection changes
        h4p.gvSetstring("Zero gas",CSTR(String(cal.read_calibration_var("ref", "zero", currentGas, currentSensor))));
        h4p.gvSetstring("Span gas",CSTR(String(cal.read_calibration_var("ref", "span", currentGas, currentSensor))));
        break;
      }

      if(svc=="Δ Type"){ // Test differential gas selection
        h4wifi.uiMessage("You chose %s\n",CSTR(msg));
        h4wifi.uiSetValue("Δ Gas",CSTR(msg));
        Serial.print("You chose "); Serial.println(msg.c_str());
        // Store which gas was chosen
        currentDiffGas = msg.c_str();
        break;
      }
      break;
  }
});

