kebasaa/datalogger_esp8266/src/main.cpp
/*
void onRTC(){
  Serial.println("Clock valid!");
  ClockValid = true;
  Serial.printf("\nReceived NTP time: %s (UTC)\n\n", CSTR(h4tk.strfDateTime( "%a %Y-%m-%d %H:%M:%S", h4tk.clockEPOCHLocal()) ));
}
*/

/*
void h4pGlobalEventHandler(const std::string& svc,H4PE_TYPE t,const std::string& msg)
{
	switch (t)
	{
		H4P_DEFAULT_SYSTEM_HANDLER;
	case H4PE_SERVICE:
		H4P_SERVICE_ADAPTER(WiFi);
#if USE_MQTT
		H4P_SERVICE_ADAPTER(MQTT);
#endif
		break;
	case H4PE_VIEWERS:
		H4P_SERVICE_ADAPTER(Viewers);
		break;
	default:
		break;
	}
}
*/

void processDataBuffered(void){
  CsvBuffer row;
  csv_init(row, data_row_buf, sizeof(data_row_buf));
  Cal::CalibrationResult cal_result;
  uint32_t gps_chars_this_sample = 0;
  bool gps_date_valid = false;
  bool gps_time_fresh = false;
  bool gps_location_valid = false;
  bool gps_location_fresh = false;

#if USE_GPS
  gps_chars_this_sample = gps.update_values();
  gps_date_valid = isGPSDateValid();
  gps_time_fresh = isGPSTimeFresh();
  gps_location_valid = gps.locationValid();
  gps_location_fresh = isGPSLocationFresh();
  if (gps_time_fresh) {
    String date = gps.get_date();
    strncpy(last_valid_gps_date, date.c_str(), sizeof(last_valid_gps_date) - 1);
    last_valid_gps_date[sizeof(last_valid_gps_date) - 1] = '\0';
    gps_boot_locked = true;
  }
  if (!gps_boot_locked) {
    Serial.println(F("Waiting for first fresh GPS date/time before logging"));
    return;
  }
  if (!gps_time_fresh && gps_chars_this_sample == 0) {
    gps_stale_count++;
    if (!gps_stale_active && gps_stale_count >= GPS_STALE_CONSECUTIVE_SAMPLES) {
      gps_stale_active = true;
      gps_stale_status_pending = true;
    }
    uint32_t now_ms = millis();
    if (gps_stale_count >= GPS_STALE_CONSECUTIVE_SAMPLES &&
        (last_gps_recovery_ms == 0 || now_ms - last_gps_recovery_ms >= GPS_RECOVERY_COOLDOWN_MS)) {
      recoverGPS();
    }
  } else if (gps_time_fresh) {
    if (gps_stale_active) gps_recovered_status_pending = true;
    gps_stale_active = false;
    gps_stale_count = 0;
  }
#else
  gps_boot_locked = true;
#endif

  if (!data_header_ready) build_data_header();
  sample_counter++;

  uint16_t row_status = last_data_write_status;
  uint32_t uptime_ms = millis() - boot_ms;
  csv_uint(row, boot_id);
  csv_uint(row, sample_counter);
  csv_uint(row, uptime_ms);
  csv_uint(row, millis());
  csv_field(row, reset_reason_buf);

#if USE_GPS
  csv_int(row, gps_date_valid ? 1 : 0);
  csv_int(row, gps_time_fresh ? 1 : 0);
  csv_int(row, gps_location_valid ? 1 : 0);
  csv_int(row, gps_location_fresh ? 1 : 0);
  csv_uint(row, gps_chars_this_sample);
  csv_uint(row, gps.gpsAgeMs());
  csv_uint(row, gps.locationAgeMs());
  csv_uint(row, gps_stale_count);
  csv_uint(row, gps_recovery_count);
  if (gps_time_fresh) {
    String timestamp = gps.get_timestamp();
    csv_field(row, timestamp.c_str());
  } else {
    csv_field(row, "");
  }
  if (gps_location_fresh) {
    csv_float(row, gps.get_lat(), 8);
    csv_float(row, gps.get_lon(), 8);
  } else {
    csv_field(row, "");
    csv_field(row, "");
  }
  if (gps_location_fresh && gps.altitudeValid()) csv_float(row, gps.get_alt(), 2);
  else csv_field(row, "");
  csv_uint(row, gps.satellites());
  csv_float(row, gps.hdop(), 2);
#endif

#if USE_BATTERY
  csv_int(row, bat.battery_mV());
  csv_int(row, bat.battery_pc());
#endif

#if I2C_MULTI
  size_t n = sizeof(i2c_buses)/sizeof(i2c_buses[0]);
#else
  size_t n = 1;
#endif
  for (size_t i = 0; i < n; ++i) {
    uint32_t bus_start_ms = millis();
    bool bus_error = false;

#if USE_ADS1115
    float ads_in = ads_sensors[i]->read_val(1, 16, 25.83);
    float ads_out = ads_sensors[i]->read_val(2, 16, 30.98);
    bus_error |= isnan(ads_in) || isnan(ads_out);
    csv_float(row, ads_in, 2);
    csv_float(row, ads_out, 2);
#endif

#if USE_BME280
    float bme_temp = bme_sensors[i]->airT();
    float bme_rh   = bme_sensors[i]->airRH();
    float bme_p    = bme_sensors[i]->airP();
    float bme_h2o  = env.air_water_mole_frac(bme_temp, bme_rh, bme_p);
    bus_error |= isnan(bme_temp) || isnan(bme_rh) || isnan(bme_p) || isnan(bme_h2o);
    csv_float(row, bme_temp, 2);
    csv_float(row, bme_rh, 2);
    csv_float(row, bme_p, 2);
    csv_float(row, bme_h2o, 2);
  #if USE_CAL
    float rh_flag = 0;
    cal_result = cal.calibrate_linear("temperature", i, bme_temp);
    float cal_temp = cal_result.calibratedValue;
    csv_float(row, cal_temp, 2);
    csv_int(row, cal_result.flag);
    rh_flag += cal_result.flag;
    cal_result = cal.calibrate_linear("pressure", i, bme_p);
    float cal_p = cal_result.calibratedValue;
    csv_float(row, cal_p, 2);
    csv_int(row, cal_result.flag);
    rh_flag += cal_result.flag;
    cal_result = cal.calibrate_linear("h2o", i, bme_h2o);
    float cal_h2o = cal_result.calibratedValue;
    csv_float(row, cal_h2o, 2);
    csv_int(row, cal_result.flag);
    rh_flag += cal_result.flag;
    float cal_rh = env.air_relative_humidity(cal_temp, cal_p, cal_h2o);
    csv_float(row, cal_rh, 2);
    csv_float(row, rh_flag, 2);
  #else
    csv_float(row, bme_temp, 2);
    csv_float(row, bme_rh, 2);
    csv_float(row, bme_p, 2);
    csv_float(row, bme_h2o, 2);
  #endif
#endif

#if USE_SCD30
  #if USE_BME280
    if (sample_counter % 3 == 0) scd_sensors[i]->set_air_pressure(bme_p);
  #endif
    scd_sensors[i]->getData();
    float scd_T   = scd_sensors[i]->airT();
    float scd_RH  = scd_sensors[i]->airRH();
    float scd_CO2 = scd_sensors[i]->airCO2();
    bus_error |= isnan(scd_T) || isnan(scd_RH) || isnan(scd_CO2);
    csv_float(row, scd_T, 2);
    csv_float(row, scd_RH, 2);
    csv_float(row, scd_CO2, 2);
  #if USE_CAL
    cal_result = cal.calibrate_linear("co2", i, scd_CO2);
    csv_float(row, cal_result.calibratedValue, 2);
    csv_int(row, cal_result.flag);
  #else
    csv_float(row, scd_CO2, 2);
  #endif
#endif

#if USE_SEN0465
    float sen_T = sen_sensors[i]->airT();
    float sen_O2 = sen_sensors[i]->airO2();
    bus_error |= isnan(sen_T) || isnan(sen_O2);
    csv_float(row, sen_T, 2);
    csv_float(row, sen_O2, 2);
  #if USE_CAL
    cal_result = cal.calibrate_linear("o2", i, sen_O2);
    csv_float(row, cal_result.calibratedValue, 2);
    csv_int(row, cal_result.flag);
  #else
    csv_float(row, sen_O2, 2);
  #endif
#endif

#if USE_MLX90614
    float mlx_t = mlx_sensors[i]->airT();
    float mlx_obj_t = mlx_sensors[i]->objT();
    bus_error |= isnan(mlx_t) || isnan(mlx_obj_t);
    csv_float(row, mlx_t, 2);
    csv_float(row, mlx_obj_t, 2);
#endif

